 IDENTIFICATION DIVISION.
 PROGRAM-ID. PrfrmUntilInlineB.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 MyVar PIC 9(5) VALUE 1.

 PROCEDURE DIVISION.
 MainProgram.
      PERFORM UNTIL MyVar = 13
        DISPLAY "Inline!"
      END-PERFORM.
      DISPLAY "Done".
      STOP RUN.
