 DATA DIVISION.
 WORKING-STORAGE SECTION.
 COPY "TEST-IMPORT.cpy".
 COPY "bla-bli-blubb.cpy".


 PROCEDURE DIVISION USING TIGER-ENTE.

 0000-MAIN SECTION.
      START-SECTION.
	.
 0000-MAIN-EXIT.
       EXIT PROGRAM.


 COPY "log-12340-sql-error.cpy".
 COPY "SMURF-SECTIONS.cpy".
