 IDENTIFICATION DIVISION.
 PROGRAM-ID. DataDeclarationz.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 n PIC 9 VALUE 5.
 01 m PICTURE 9(4) VALUE 1234.

 PROCEDURE DIVISION.
 MainProgram.
      IF (n + m) < 10 THEN
        DISPLAY "Yeah"
      END-IF
      STOP RUN.
