 IDENTIFICATION DIVISION.
 PROGRAM-ID. SimpleMove.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 n PIC 9 VALUE 5.
 01 m PICTURE 9(4) VALUE 1234.

 PROCEDURE DIVISION.
 MainProgram.
      MOVE 44 TO m
      STOP RUN.
